/*	В разчертан квадрат с размери 3x3,
сме номерирали последователно
получените кутийките по редове,
с числата от 1 до 9.
	Вход: цяло число n, n>0 && n<10,
и n числа, като всяко число е от 1 до 9.
	Изход: Квадратче от точки или X-чета,
като X-чета са поставени на мястото на
кутийките на квадратчето с номера,
съвпадащи с допълнитено въведените n числа. */
#include <iostream>
using namespace std;
main ()
{
	char r[3][3] ;
	int n, a, red, col ;
	cin >>n;
	for (red=0; red<3; red++)
		for (col=0; col<3; col++)
			r[red][col] = '.' ;

	for (int k=0; k<n; k++)
	{
		cin >>a;
		a--;
		red = a/3; 
		col = a%3;
		r [red][col] = 'x';
	}

	for (red=0; red<3; red++)
	{
		for (col=0; col<3; col++)
			cout <<r[red][col] ;
		cout <<endl;
	}
}
